/*
 Дано 2 массива. Первый массив String[] содержит имена студентов.
 Второй массив double[] содержит средний балл  студентов.
 i-й элемент первого массива соответствует i-элементу второго массива.
 Длины массивов равны. Необходимо написать метод, который возвращает имя самого
 успешного студена. В данной задаче, если 2 и более студента имеют лучший бал,
 метод может вернуть имя любого из них.

 */

public class    Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}