/*
Создать новый проект. Написать программу, которая выводит на экран
фразу: “ The area of a rectangle with sides 21 and 17 is ….”
Вместо многоточия программа должна сосчитать площадь прямоугольника
и вывести число.

 */


public class Main {
    public static void main(String[] args) {

        // "The area of a rectangle with sides 21 and 17 is 357”
        System.out.println("\"The area of a rectangle with sides 21 and 17 is " + (21 *      17) +"\"" );

    }
}